eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаПроект/абс_ЗаявкаНаПроект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаПроект</name>
  <registerRecords>AccumulationRegister.абс_ДДСПоПроектам</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроекта</name>
    <type>
      <types>CatalogRef.абс_ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроекта</name>
    <type>
      <types>EnumRef.абс_СтатусыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПроектов</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТитула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетРеализацииПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроекта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкупаемостиПроекта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроекта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроекта</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа_удалить</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийЗаявкаНаПроект</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяТЭО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортфельПроекта</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДанных</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Доходный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеТребуетсяСогласованиеРПвЗЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоходыПроектов</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходыПроектов</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты_удалить</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТитула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПроекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриоритетРеализацииПроекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПроекта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПроекта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкупаемостиПроекта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПроекта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПроекта</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТЭО</name>
      <type>
        <types>CatalogRef.абс_ТЭО</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборотыБюджетов</name>
    <attributes>
      <name>абс_ТипРасхода</name>
      <type>
        <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_КВ</name>
      <type>
        <types>CatalogRef.абс_КапитальныеВложения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ЦФУ</name>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяОборотов</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ТипКонтрагента</name>
      <type>
        <types>CatalogRef.абс_ТипыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ТипСети</name>
      <type>
        <types>CatalogRef.абс_ТипыСетей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСценария</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлатежиПоПроектам</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактОперФакт</name>
      <type>
        <types>EnumRef.абс_ФактОперФакт</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаАванс</name>
      <type>
        <types>EnumRef.ВидыОтчетовПоПлатежамКомиссия</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <comment>Незакрытый документ поставки/оплаты</comment>
      <type>
        <types>DocumentRef.ОтчетКомитентуОПродажах</types>
        <types>DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</types>
        <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
        <types>DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</types>
        <types>DocumentRef.ОплатаОтПокупателяПлатежнойКартой</types>
        <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
        <types>DocumentRef.АккредитивПолученный</types>
        <types>DocumentRef.РеализацияУслугПоПереработке</types>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
        <types>DocumentRef.ПоступлениеДопРасходов</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.АккредитивПереданный</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОперацияБух</types>
        <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ПоступлениеНМА</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
        <types>DocumentRef.ИнкассовоеПоручениеПолученное</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
        <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
        <types>DocumentRef.ПередачаНМА</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПолучениеУслугПоПереработке</types>
        <types>DocumentRef.ИнкассовоеПоручениеПереданное</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПроектов/абс_СтатусыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПроектов</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДТР</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭИ</name>
  </enumValues>
  <enumValues>
    <name>РазработкаТЭО</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеИК</name>
  </enumValues>
  <enumValues>
    <name>РазраоткаИТРДП</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДЭИ</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Эксплуатация</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>ОтказСогласования</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеТЭО</name>
  </enumValues>
  <enumValues>
    <name>ТехническоеСогласование</name>
  </enumValues>
  <enumValues>
    <name>РазработкаИИТРТЭО</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаПроект/ManagerModule.bsl
Процедура ЗаполнитьСписокДоступныхСтатусов(Список,Ссылка) Экспорт	
	
	//АБС Изменение 12114 Родин Проектный учет
	мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);
	
	Список.Очистить();
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Список.Добавить(Перечисления.абс_СтатусыПроектов.Подготовка);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ссылка.СтатусПроекта) Тогда
		 Список.Добавить(Перечисления.абс_СтатусыПроектов.Подготовка);
		Возврат;
    Иначе
		Список.Добавить(Ссылка.СтатусПроекта);
	КонецЕсли;
	
	Если Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.Подготовка Тогда
		Список.Добавить(Перечисления.абс_СтатусыПроектов.ТехническоеСогласование);
		Список.Добавить(Перечисления.абс_СтатусыПроектов.Отказ);
	ИначеЕсли Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.ТехническоеСогласование Тогда
		
		РольИсполнителей = Справочники.РолиИсполнителей.ДиректорДирекции;	
		
		// {{ТТК Лапин А. Заявка № 000034027 24.09.2015 начало
		// {{ Старый код:
		//ПользовательИсполнитель = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(
		//абс_БизнесПроцессы.ПолучитьОтветственныхПодразделения(
		//абс_БизнесПроцессы.ПолучитьПодразделениеДирекции(
		//Ссылка.Инициатор.абс_Сотрудник.ПодразделениеОрганизации),, Ссылка.Организация));
		// }} старый код 
		// {{ Новый код:
		ТекПодразделениеОрганизации = Ссылка.Инициатор.абс_Сотрудник.ПодразделениеОрганизации;
		ПользовательИсполнитель = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(
		абс_БизнесПроцессы.ПолучитьОтветственныхПодразделения(ТекПодразделениеОрганизации,, Ссылка.Организация));
		
		ПользовательИсполнитель2 = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(
		абс_БизнесПроцессы.ПолучитьОтветственныхПодразделения(ТекПодразделениеОрганизации.Родитель,, Ссылка.Организация));
		
		//Если ПользовательИсполнитель.Найти(мТекущийПользователь) <> Неопределено ИЛИ НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.ПроектныйУчетЭкономистПроекта) = Неопределено Тогда
		Если ПользовательИсполнитель.Найти(мТекущийПользователь) <> Неопределено ИЛИ ПользовательИсполнитель2.Найти(мТекущийПользователь) <> Неопределено ИЛИ НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.ПроектныйУчетЭкономистПроекта) = Неопределено Тогда
		// }}ТТК Лапин А. Заявка № 000034027 24.09.2015 окончание

			Список.Добавить(Перечисления.абс_СтатусыПроектов.СогласованиеДЭИ);
			Список.Добавить(Перечисления.абс_СтатусыПроектов.Отказ);
			Список.Добавить(Перечисления.абс_СтатусыПроектов.Согласован);
		КонецЕсли;
		
	ИначеЕсли Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.СогласованиеДЭИ и НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеДЭИ) = Неопределено Тогда
		
		Если Ссылка.ВидПроекта <> Справочники.абс_ВидыПроектов.ВнеПроектов Тогда
			Список.Добавить(Перечисления.абс_СтатусыПроектов.РазработкаИИТРТЭО);
			Список.Добавить(Перечисления.абс_СтатусыПроектов.Согласован);
			Список.Добавить(Перечисления.абс_СтатусыПроектов.Отказ);
		Иначе	
			Список.Добавить(Перечисления.абс_СтатусыПроектов.Согласован);
			Список.Добавить(Перечисления.абс_СтатусыПроектов.Отказ);
		КонецЕсли;
		
	ИначеЕсли Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.РазработкаИИТРТЭО  и НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.РазработкаИТРТЭО) = Неопределено Тогда
		Список.Добавить(Перечисления.абс_СтатусыПроектов.Согласован);
		Список.Добавить(Перечисления.абс_СтатусыПроектов.Отказ);
	ИначеЕсли Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.Отказ
		ИЛИ Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.ОтказСогласования Тогда	
			Список.Добавить(Перечисления.абс_СтатусыПроектов.Подготовка);
	КонецЕсли;	
	
	
	
	//Если Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.СогласованиеДТР Тогда
	//	
	//	Список.Добавить(Перечисления.абс_СтатусыПроектов.СогласованиеДЭИ);
	//	Список.Добавить(Перечисления.абс_СтатусыПроектов.Отказ);
	//	
	//ИначеЕсли Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.СогласованиеДЭИ Тогда
	//	
	//	Список.Добавить(Перечисления.абс_СтатусыПроектов.РазработкаТЭО);
	//	Список.Добавить(Перечисления.абс_СтатусыПроектов.Отказ);
	//	
	//ИначеЕсли Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.Подготовка Тогда	
	//	
	//	Список.Добавить(Перечисления.абс_СтатусыПроектов.СогласованиеДТР);
	//	
	//ИначеЕсли Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.Отказ
	//	ИЛИ Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.ОтказСогласования Тогда	
	//	
	//	Список.Добавить(Перечисления.абс_СтатусыПроектов.Подготовка);
	//	
	//ИначеЕсли Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.РазработкаТЭО Тогда
	//	
	//	Если ЗначениеЗаполнено(Ссылка.ТЭО) И Не Ссылка.ТЭО.Статус = Перечисления.абс_СтатусСогласованияТЭО.Согласован Тогда 
	//		Список.Добавить(Перечисления.абс_СтатусыПроектов.СогласованиеТЭО);
	//	ИначеЕсли ЗначениеЗаполнено(Ссылка.ТЭО) И Ссылка.ТЭО.Статус = Перечисления.абс_СтатусСогласованияТЭО.Согласован Тогда 
	//		Список.Добавить(Перечисления.абс_СтатусыПроектов.Согласован);
	//	КонецЕсли;
	//	Список.Добавить(Перечисления.абс_СтатусыПроектов.Отказ);
	//	
	//ИначеЕсли Ссылка.СтатусПроекта = Перечисления.абс_СтатусыПроектов.СогласованиеТЭО Тогда
	//	
	//	Если ЗначениеЗаполнено(Ссылка.ТЭО) И Ссылка.ТЭО.Статус = Перечисления.абс_СтатусСогласованияТЭО.Согласован Тогда 
	//		Список.Добавить(Перечисления.абс_СтатусыПроектов.Согласован);
	//	КонецЕсли;
	//	Список.Добавить(Перечисления.абс_СтатусыПроектов.Отказ);
	//	
	//КонецЕсли;
	
	Возврат;
	
	
КонецПроцедуры

Процедура СформироватьНоменклатурныеГруппыИПроекты(Ссылка) Экспорт
	НачатьТранзакцию();
	ДокОбъект = Ссылка.ПолучитьОбъект();	
	
	ЗаписыватьОбъект = Ложь;
	
	Если Не ЗначениеЗаполнено(Ссылка.Проект) Тогда
		
		Проект = Справочники.Проекты.СоздатьЭлемент();
		
	Иначе
		
		Проект = Ссылка.Проект.ПолучитьОбъект();
		
	КонецЕсли;
	
	
		
	Проект.Родитель = Ссылка.ГруппаПроектов;
	Проект.Наименование = Ссылка.НаименованиеПроекта;
	Проект.КодПроектаКомпании = Ссылка.КодТитула;
	Проект.Описание = Ссылка.ОписаниеПроекта;
	Проект.ДатаНачала = Ссылка.ДатаНачалаПроекта;
	Проект.ДатаОкончания = Ссылка.ДатаОкончанияПроекта;
	Проект.абс_Статус = Перечисления.абс_СтатусыПроектов.Действует;
	Проект.абс_ТЭО = Ссылка.ТЭО;
	Проект.абс_ВидПроекта = Ссылка.ВидПроекта;
	Проект.абс_Организация = Ссылка.Организация;
	Проект.абс_РуководительПроекта = Ссылка.РуководительПроекта;
	Проект.абс_Портфель = Ссылка.ПортфельПроекта;
	Проект.абс_ДоходныйПроект = Ссылка.Доходный;
	
	//АБС ВСТАВКА 100114 Родин Проектный учет
	Проект.абс_НеТребуетсяСогласованиеРПвЗЗ = Ссылка.НеТребуетсяСогласованиеРПвЗЗ;
	//АБС ВСТАВКА 100114 Родин Проектный учет
	
	Проект.Записать();
	
	СкопироватьФайлыИзЗаявки(Ссылка, Проект.Ссылка);
	
	ДокОбъект.Проект = Проект.Ссылка;
	ЗаписыватьОбъект = Истина;
	
	ДокументРегистрацииПлана = Документы.абс_ПлановыйГрафикОплат.СоздатьДокумент();
	ДокументРегистрацииПлана.Дата = Ссылка.Дата;
	ДокументРегистрацииПлана.Год = НачалоГода(Ссылка.Дата);
	ДокументРегистрацииПлана.ОперативныеДанные = Ложь;
	ДокументРегистрацииПлана.УсловиеОплаты = Перечисления.абс_ВидыУсловийОплатПоДоговорам.Поступление;
	ДокументРегистрацииПлана.Проект = Проект.Ссылка;
	
	
	Для Каждого СтрокаТЧ Из Ссылка.РасходыПроектов Цикл 
		НоваяСтрока = ДокументРегистрацииПлана.Оплаты.Добавить();
		НоваяСтрока.ПериодРегистрации = СтрокаТЧ.Период;
		НоваяСтрока.Сумма = СтрокаТЧ.Сумма;
	КонецЦикла;
	
	Попытка
		ДокументРегистрацииПлана.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ИнформацияОбОшибке().Описание);
	КонецПопытки;
	
	ДокументРегистрацииПлана = Документы.абс_ПлановыйГрафикОплат.СоздатьДокумент();
	ДокументРегистрацииПлана.Дата = Ссылка.Дата;
	ДокументРегистрацииПлана.Год = НачалоГода(Ссылка.Дата);
	ДокументРегистрацииПлана.ОперативныеДанные = Ложь;
	ДокументРегистрацииПлана.УсловиеОплаты = Перечисления.абс_ВидыУсловийОплатПоДоговорам.Реализация;
	ДокументРегистрацииПлана.Проект = Проект.Ссылка;
	
	Для Каждого СтрокаТЧ Из Ссылка.ДоходыПроектов Цикл 				
		НоваяСтрока = ДокументРегистрацииПлана.Оплаты.Добавить();
		НоваяСтрока.ПериодРегистрации = СтрокаТЧ.Период;
		НоваяСтрока.Сумма = СтрокаТЧ.Сумма;
	КонецЦикла;
	
	Попытка
		ДокументРегистрацииПлана.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ИнформацияОбОшибке().Описание);
	КонецПопытки;	
	
	Если ЗаписыватьОбъект Тогда
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	ЗафиксироватьТранзакцию();
КонецПроцедуры	

Процедура СкопироватьФайлыИзЗаявки(ЗаявкаНаПроект, Проект)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХранилищеДополнительнойИнформации.ИмяФайла КАК СТРОКА(50)) КАК ИмяФайла
	|ПОМЕСТИТЬ втФайлыПроекта
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект = &Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Ссылка КАК Файл,
	|	ВЫРАЗИТЬ(ХранилищеДополнительнойИнформации.ИмяФайла КАК СТРОКА(50)) КАК ИмяФайла
	|ПОМЕСТИТЬ втФайлыЗаявки
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект = &ЗаявкаНаПроект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втФайлыЗаявки.Файл
	|ИЗ
	|	втФайлыЗаявки КАК втФайлыЗаявки
	|ГДЕ
	|	НЕ втФайлыЗаявки.ИмяФайла В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					втФайлыПроекта.ИмяФайла
	|				ИЗ
	|					втФайлыПроекта КАК втФайлыПроекта)";
	Запрос.УстановитьПараметр("ЗаявкаНаПроект", ЗаявкаНаПроект);
	Запрос.УстановитьПараметр("Проект", Проект);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НовыйЭлемент = Выборка.Файл.Скопировать();
		НовыйЭлемент.Объект = Проект;
		Попытка
			НовыйЭлемент.Записать();
		Исключение
			ОбщегоНазначения.Сообщение(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры
